--
-- PostgreSQL database dump
--

-- Dumped from database version 17.4
-- Dumped by pg_dump version 17.4
<<<<<<< Updated upstream

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
=======
SET search_path TO public;
SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
>>>>>>> Stashed changes
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: schooldata; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.schooldata (
    "المنطقة" character varying(100),
    "اسم المدرسة" character varying(150),
    "اعلى صف" character varying(50),
    "مختلطة" character varying(50),
    "تقبل الطلبة من ذوي الإحتياجات" character varying(100),
    "نظام التعليمي" character varying(50),
    "لغة التدريس" character varying(50),
    "الروضة | براعم" double precision,
    "الروضة | بستان" double precision,
    "الروضة | تمهيدي" double precision,
    "الصف الاول" double precision,
    "الصف الثاني" double precision,
    "الصف الثالث" double precision,
    "الصف الرابع" double precision,
    "الصف الخامس" double precision,
    "الصف السادس" double precision,
    "الصف السابع" double precision,
    "الصف الثامن" double precision,
    "الصف التاسع" double precision,
    "الصف العاشر" double precision,
    "الصف الأول ثانوي" double precision,
    "الصف الثاني ثانوي" double precision
);


<<<<<<< Updated upstream
ALTER TABLE public.schooldata OWNER TO postgres;
=======
>>>>>>> Stashed changes

--
-- Name: user_filters; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.user_filters (
    id integer NOT NULL,
    firebase_uid text NOT NULL,
    location text,
    special_needs text,
    language text,
    mixed text,
    grade_from text,
    grade_to text,
    created_at timestamp without time zone DEFAULT CURRENT_TIMESTAMP
);


<<<<<<< Updated upstream
ALTER TABLE public.user_filters OWNER TO postgres;
=======
>>>>>>> Stashed changes

--
-- Name: user_filters_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.user_filters_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


<<<<<<< Updated upstream
ALTER SEQUENCE public.user_filters_id_seq OWNER TO postgres;
=======
>>>>>>> Stashed changes

--
-- Name: user_filters_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.user_filters_id_seq OWNED BY public.user_filters.id;


--
-- Name: user_filters id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_filters ALTER COLUMN id SET DEFAULT nextval('public.user_filters_id_seq'::regclass);


--
-- Data for Name: schooldata; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.schooldata ("المنطقة", "اسم المدرسة", "اعلى صف", "مختلطة", "تقبل الطلبة من ذوي الإحتياجات", "نظام التعليمي", "لغة التدريس", "الروضة | براعم", "الروضة | بستان", "الروضة | تمهيدي", "الصف الاول", "الصف الثاني", "الصف الثالث", "الصف الرابع", "الصف الخامس", "الصف السادس", "الصف السابع", "الصف الثامن", "الصف التاسع", "الصف العاشر", "الصف الأول ثانوي", "الصف الثاني ثانوي") FROM stdin;
القسطل	التحفة	الصف العاشر	مختلطة إلى  الصف الثالث	نعم ، التوحد 	وطني	الإنجليزية / عربية	\N	550	600	750	800	850	900	950	1000	1050	1100	1150	1200	250	175
الفيصلية	وسام و ريان	الصف السادس	مختلطة إلى  الصف السادس	نعم ، التوحد 	وطني	العربية	\N	200	250	400	450	500	550	600	650	\N	\N	\N	\N	\N	\N
ام بطمة	طیور المغفرة الاسلامیة	الصف السادس	مختلطة إلى  الصف السادس	لا	وطني	العربية	\N	293	350	520	553	587	620	653	687	\N	\N	\N	\N	\N	\N
قضاء الرجم الشامي	الفهرس	الصف السابع	مختلطة إلى  الصف السابع	نعم ، التوحد	وطني	العربية	\N	400	500	700	733	767	800	867	933	1000	\N	\N	\N	\N	\N
قرية سالم	مدرسة و روضة الضفتين الإسلامية	الصف العاشر	غير مختلطة	نعم ، صعوبات تعلم	وطني	العربية	\N	500	500	550	600	650	700	833	967	1100	1200	1300	1400	\N	\N
العبدلية	روضة ومدرسة الموحدين الإسلامية	الصف السابع	مختلطة إلى  الصف السادس	نعم ، التوحد 	وطني	العربية	\N	350	350	590	610	630	680	700	720	750	\N	\N	\N	\N	\N
الخشافية	المهند	الصف السادس	مختلطة إلى  الصف السادس	نعم ، إعاقة حركية;صعوبات تعلم	وطني	العربية	\N	400	450	600	650	700	750	800	850	\N	\N	\N	\N	\N	\N
سحاب	البراق الاسلامية	الصف السادس	مختلطة إلى  الصف الخامس	نعم ، التوحد ، حسب حالة  التوحد	وطني	العربية	\N	470	590	680	713	747	780	813	847	\N	\N	\N	\N	\N	\N
سحاب	البنية الحديثة	الصف العاشر	غير مختلطة	لا	وطني	الإنجليزية / عربية	\N	460	460	630	665	700	735	770	840	910	980	1085	1185	\N	\N
سحاب	أكاديمية الكتاب المنير الخاصة	الصف التاسع	مختلطة إلى  الصف التاسع	نعم ، التوحد ، يتم قبول بعض حالات التوحد - حسب الحالة	وطني	العربية	\N	300	367	500	567	633	700	733	767	800	833	867	\N	\N	\N
سحاب	منارة الاندلس النموذجية	الصف الثاني عشر	مختلطة إلى  الصف الثالث	نعم ، التوحد - إعاقة حركية - صعوبات تعلم	وطني	العربية	\N	590	590	680	740	790	840	890	960	990	1050	1150	1200	1580	2130
سحاب	المشاهير للعلم والمعرفة	الصف الثاني عشر	غير مختلطة	نعم ، التوحد ، يتم قبول بعض حالات التوحد - حسب الحالة	وطني	العربية	\N	450	450	650	800	850	925	975	1000	1025	1050	1150	1300	1450	1850
راس العين	مدرسة جمعية باب الواد	الصف السادس	مختلطة إلى  الصف السادس	لا	وطني	العربية	\N	\N	\N	775	775	775	775	775	775	\N	\N	\N	\N	\N	\N
راس العين	الماجد الدولية	الصف الثاني عشر	مختلطة إلى  الصف الثالث	لا	وطني	العربية	\N	500	600	800	850	850	850	900	950	1000	1150	1350	1500	1700	1900
راس العين	راهبات الوردية - المصدار	الصف العاشر	مختلطة إلى  الصف السادس	نعم	وطني	العربية	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N
راس العين	النجوم الصاعده	روضة	\N	لا	وطني	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N
راس العين	الشهباء	الصف السادس	مختلطة إلى  الصف السادس	لا	وطني	العربية	\N	\N	\N	500	567	633	700	767	833	\N	\N	\N	\N	\N	\N
اليرموك	الروم الكاثوليك - الاشرفية	الصف العاشر	مختلطة إلى  الصف العاشر	نعم ، التوحد ، صعوبات التعلم ، يتم قبول بعض حالات التوحد - حسب الحالة	وطني	الإنجليزية / عربية	\N	495	595	650	678	707	735	768	802	835	868	902	935	\N	\N
اليرموك	دير اللاتين (البطريركية الوطنية) - المصدار	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	نعم	وطني	العربية	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	1000	1050	1200
اليرموك	روابي القدس الاولى	الصف الثاني عشر	مختلطة إلى  الصف الثالث	نعم ، إعاقة حركية;صعوبات تعلم	وطني	العربية	\N	675	692	725	842	958	1075	1138	1202	1265	1332	1399	1466	1533	1600
اليرموك	الوطنية الارثوذكسية - الاشرفية	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	لا	وطني	العربية	\N	\N	\N	950	1000	1050	1100	1150	1200	1250	1350	1450	1550	1650	1750
اليرموك	الدوحة	الصف السادس	مختلطة إلى  الصف السادس	لا	وطني	العربية	\N	550	680	740	753	767	780	793	807	\N	\N	\N	\N	\N	\N
زهران	مدرسة المطران للبنين و الأهلية للبنات	الصف الثاني عشر	إناث فقط	نعم ، التوحد ، حسب درجة التوحد	وطني/اجنبي	العربية	\N	2650	2850	3200	3500	3800	4100	4300	4500	4700	5500	6300	7100	7900	8700
زهران	الكلية العلمية الاسلامية - جبل عمان - ذكور	الصف الثاني عشر	ذكور فقط	نعم ، حسب الحالة	وطني/اجنبي	الإنجليزية / عربية	\N	2325	2400	2550	2632	2713	2795	2797	2798	2800	2960	3120	3280	3440	3600
زهران	الكلية العلمية الاسلامية - جبل عمان - ذكور  	الصف الثاني عشر	ذكور فقط	نعم ، حسب الحالة	وطني	الإنجليزية / عربية	\N	3250	3367	3600	3683	3767	3850	4067	4283	4500	4760	5020	5280	5540	5800
زهران	روابي الربيع الدولية	الصف الثامن	مختلطة إلى  الصف الثامن	نعم ، إعاقة حركية - صعوبات تعلم	وطني	الإنجليزية / عربية	\N	2000	2100	2300	2600	2900	3200	3433	3667	3900	4200	\N	\N	\N	\N
زهران	الأدفنتست الأهلية	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	لا	وطني	العربية	\N	790	790	790	843	897	950	1040	1130	1220	1376	1532	1688	1844	2000
المدينة	الحرمين	الصف السابع	مختلطة إلى  الصف السابع	نعم ، التوحد ، يتم قبول بعض حالات التوحد - حسب الحالة	وطني	العربية	357	400	443	530	560	605	650	667	683	700	\N	\N	\N	\N	\N
المدينة	رواد الأقصى	الصف السابع	مختلطة إلى  الصف السابع	نعم ، التوحد ، يتم قبول بعض حالات التوحد - حسب الحالة	وطني	العربية	500	500	550	650	700	700	700	800	800	850	\N	\N	\N	\N	\N
المدينة	رواد الأنصار	الصف السابع	غير مختلطة	لا	وطني	العربية	450	500	550	750	750	750	800	800	800	850	\N	\N	\N	\N	\N
بدر	المواكب - عمان	الصف الحادي عشر	مختلطة إلى  الصف الرابع	لا	وطني	العربية	600	650	700	950	1000	1050	1100	1150	1200	1250	1300	1350	1400	1450	\N
بدر	روضة ومدارس الأكاديمية الأردنية	الصف العاشر	غير مختلطة	لا	وطني	العربية	500	550	600	600	700	700	700	700	700	700	700	\N	\N	\N	\N
بدر	المشاعل الحديثة	الصف السابع	مختلطة إلى  الصف السابع	نعم ، صعوبات التعلم	وطني	العربية	\N	\N	\N	600	650	700	750	800	850	900	\N	\N	\N	\N	\N
بدر	الفكر التربوي (1) - الياسمين	الصف الثاني عشر	غير مختلطة	نعم ، التوحد ، إعاقة حركية ، صعوبات تعلم	وطني	الإنجليزية / عربية	\N	\N	\N	650	750	800	850	\N	\N	\N	\N	\N	\N	\N	\N
بدر	روضة ومدارس الأماني العلمية	الصف الثاني عشر	غير مختلطة	لا	وطني	العربية	\N	600	600	850	900	950	1100	1150	1200	1300	1350	1400	1550	1800	2100
العبدلي	راهبات الوردية - الشميساني	الصف الثاني عشر	اناث فقط	لا	وطني	العربية	1800	1800	1800	1800	1850	1900	1950	2047	2143	2240	2482	2724	2966	3208	3450
العبدلي	تراسانطة	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	لا	وطني/اجنبي	الإنجليزية / عربية	2057	1838	1619	1180	1537	1895	2252	2302	2352	2402	2593	2784	2974	3165	3356
العبدلي	المتكاملة الدولية	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	نعم ، التوحد ، يتم قبول بعض حالات التوحد - حسب الحالة	وطني	العربية	525	550	680	700	750	800	850	892	933	975	1080	1185	1290	1395	1500
العبدلي	رواد الرملة	الصف التاسع	مختلطة إلى  الصف الرابع	لا	وطني	العربية	550	575	600	650	683	717	750	812	873	935	997	1058	\N	\N	\N
العبدلي	International Participatory - مدارس التشاركية الدولية	الصف الثامن	مختلطة إلى  الصف الثامن	لا	وطني/اجنبي	الإنجليزية / عربية	\N	2200	2200	2150	2250	2350	2450	2200	2200	\N	\N	\N	\N	\N	\N
الصناعة	الايوب	الصف السابع	مختلطة إلى  الصف السابع	نعم ، التوحد ، يتم قبول بعض حالات التوحد - حسب الحالة	وطني	العربية	633	700	767	900	917	933	950	1000	1050	1100	\N	\N	\N	\N	\N
دير غبار	أكاديمية بذور القادة الدولية	الصف السابع	مختلطة إلى  الصف الخامس	نعم ، صعوبات تعلم ، اعاقة حركية ، توحد	وطني/اجنبي	الإنجليزية / عربية	\N	\N	\N	1400	1400	1400	1600	1600	1600	1700	\N	\N	\N	\N	\N
دير غبار	عبد الحميد شرف	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	نعم ، التوحد ، يتم قبول بعض حالات التوحد - حسب الحالة	وطني/اجنبي	الإنجليزية	1300	1450	1700	1650	1700	1800	1900	2000	2100	2200	2250	2350	2400	2500	2550
دير غبار	مارشال الدولية	الصف العاشر	مختلطة إلى  الصف السادس	لا	وطني/اجنبي	الإنجليزية / عربية	\N	2600	2750	2050	2150	2250	2350	2450	2550	2650	2750	2850	2950	\N	\N
دير غبار	مارشال الدولية international	الصف العاشر	مختلطة إلى  الصف السادس	لا	وطني/اجنبي	الإنجليزية / عربية	\N	2600	2750	2950	3050	3150	3250	3450	3650	3850	4050	4250	4450	\N	\N
دير غبار	The Little Academy	الصف الرابع	غير مختلطة	لا	وطني	العربية	\N	\N	\N	1500	1550	1600	1650	1700	1750	1800	1850	1900	1950	\N	\N
ام اذينة الغربي	رويال	الصف العاشر	مختلطة إلى  الصف العاشر	لا	وطني	العربية	\N	\N	\N	1500	1550	1600	1650	1700	1750	1800	1850	1900	1950	\N	\N
الظهير	مدرسة الأمير حمزة بن الحسين الثانوية الخاصة المختلطة	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	نعم ، حسب الحالة	وطني	العربية	\N	1180	1180	1240	1270	1300	1350	1400	1450	1520	1630	1700	1820	2030	2230
الظهير	روضة و مدارس المدار الدولية	الصف الثاني عشر	مختلطة إلى  الصف الخامس	لا	وطني	العربية	1200	1200	1300	1350	1400	1450	1500	1550	1600	1675	1725	1810	1895	1925	2275
بدر الجديدة	مدرسة وروضة بدر الجديدة	الصف التاسع	مختلطة إلى  الصف التاسع	لا	وطني	العربية	400	450	500	650	750	800	900	1000	1050	1100	1200	1300	\N	\N	\N
عراق الامير	بحار المعرفة	الصف الثامن	مختلطة إلى  الصف الثامن	نعم ، التوحد ، صعوبات التعلم ، يوجد مركز صعوبات تعلم	وطني	العربية	467	550	633	800	833	867	900	1000	1100	1200	1300	\N	\N	\N	\N
الصويفية	مدرسة بطريركية الروم الأرثوذكس المقدسية	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	لا	وطني	العربية	1330	1375	1405	1670	1680	1690	1700	1768	1837	1905	2057	2209	2361	2513	2665
الصويفية	المدرسة الأمريكية الحديثة Modern American School	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	نعم ، حسب ما يملك الطالب من تقارير طبية	وطني/اجنبي	الإنجليزية / عربية	3850	4380	4900	5980	6278	6577	6875	7483	8092	8700	9356	10012	10668	11324	11980
الصويفية	اكاديمية خليل الرحمن - الصويفية	الصف الثاني عشر	مختلطة إلى  الصف الرابع	نعم ، لا يوجد مصادر	وطني	الإنجليزية / عربية	1145	1195	1215	1535	1645	1755	1865	1838	2035	2085	2145	2195	2255	2465	2750
الكرسي	المجد الوطنية الثانية - الكرسي	الصف الحادي عشر	مختلطة إلى  الصف العاشر	لا	وطني	العربية	\N	\N	810	990	1040	1135	1200	1270	1335	1390	1470	1565	1680	2000	\N
الجندويل	المجد الوطنية الأولى - الجندويل	الصف الحادي عشر	مختلطة إلى  الصف الحادي عشر	لا	وطني	العربية	\N	\N	810	990	1040	1135	1200	1270	1335	1390	1470	1565	1680	2000	\N
السابع والثامن الأمير راشد	مدى الأولى	الصف السابع	مختلطة إلى  الصف الرابع	لا	وطني	العربية	1433	1550	1667	1900	2000	2100	2200	2300	2400	2500	\N	\N	\N	\N	\N
السابع والثامن الأمير راشد	روضة و مدرسة الدوار السابع	الصف العاشر	مختلطة إلى  الصف العاشر	نعم ، التوحد ، يتم قبول بعض حالات التوحد - حسب الحالة	وطني	العربية	700	750	800	1500	1550	1600	1650	1700	1750	1800	1850	1900	1950	\N	\N
السابع والثامن الأمير راشد	أكاديمية الترويج العلمي	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	لا	وطني	الإنجليزية / عربية	\N	\N	\N	1100	1200	1250	1300	1350	1400	1600	1650	1700	1800	2100	2300
السابع والثامن الأمير راشد	الصفوة الاسلامية - اناث	الصف الثاني عشر	اناث فقط	لا	وطني	العربية	\N	\N	\N	750	800	800	850	900	950	1000	1150	1250	1400	1500	1650
السابع والثامن الأمير راشد	أكاديمية تزكية الدولية	الصف الثاني عشر	مختلطة إلى  الصف الرابع	لا	وطني	الإنجليزية / عربية	1600	1700	1800	1950	2000	2100	2200	2300	2400	2500	2600	2700	2800	2900	3900
مرج الحمام	أكاديمية أمل	الصف السادس	مختلطة إلى  الصف السادس	نعم ، الإعاقة الحركية	وطني	العربية	600	700	800	1000	1000	1000	1000	1000	\N	\N	\N	\N	\N	\N	\N
مرج الحمام	مدارس كوفنتري الدولية	الصف الثاني عشر	غير مختلطة	تقبل الطلبة من ذوي الإحتياجات	وطني/اجنبي	الإنجليزية / عربية	\N	\N	\N	1200	1250	1300	1450	1500	1600	1700	1800	1950	2100	2300	2500
مرج الحمام	درّة النخيل الدولية	الصف السابع	مختلطة إلى  الصف السابع	لا	وطني	الإنجليزية / عربية	\N	550	550	900	950	1000	1050	1100	1150	1200	\N	\N	\N	\N	\N
مرج الحمام	المدارس العالمية	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	لا	وطني/اجنبي	الإنجليزية / عربية	1000	1050	1100	1200	1250	1300	1500	1600	1650	1800	1950	2000	2100	2425	2600
مرج الحمام	راهبات الوردية - مرج الحمام	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	لا	وطني	الإنجليزية 	1650	1770	1850	2100	2183	2267	2350	2460	2570	2680	2970	3260	3550	3840	4130
البيادر	الراهبات الفرنسيسكانيات/ ماريوسف	الصف الثاني عشر	مختلطة إلى  الصف الثاني عشر	نعم ، التوحد ، يتم قبول بعض حالات التوحد - حسب الحالة	وطني/اجنبي	الإنجليزية / عربية	1950	1950	1950	2000	2020	2040	2060	2200	2250	2300	2500	2700	2850	3000	3200
البيادر	الواحه النموذجيه	الصف الثالث	مختلطة إلى  الصف الثالث	لا	وطني	العربية	\N	700	750	800	850	900	880	\N	\N	\N	\N	\N	\N	\N	\N
البيادر	مدرسة القمة	الصف الثاني عشر	مختلطة إلى  الصف الثالث	لا	وطني/اجنبي	الإنجليزية / عربية	\N	1400	1400	1600	1600	1600	1800	1800	2000	2000	2400	2600	2800	3200	3200
البيادر	الرقي التربوي	الصف العاشر	مختلطة إلى  الصف العاشر	لا	وطني	العربية	\N	580	640	740	800	860	920	980	1040	1100	1160	1220	1280	\N	\N
البيادر	الدرة الشريفة - فرع البيادر	الصف الثاني عشر	مختلطة إلى  الصف الثالث	لا	وطني	العربية	1000	1100	1150	1300	1350	1400	1500	1600	1700	1800	1900	2000	2150	2400	2600
خريبة السوق وجاوا واليادودة	الراجح	الصف السادس	مختلطة إلى  الصف السادس	نعم ، صعوبات تعلم ، اعاقة حركية ، توحد	وطني	العربية	\N	375	409	554	594	634	673	614	648	\N	\N	\N	\N	\N	\N
خريبة السوق وجاوا واليادودة	اوسكار الدولية	الصف الثامن	مختلطة إلى  الصف الثامن	لا	وطني	الإنجليزية / عربية	\N	725	775	825	875	950	1000	1050	1100	1150	1200	\N	\N	\N	\N
خريبة السوق وجاوا واليادودة	مدارس و روضة إمارة الشرق الأهلية	الصف السادس	مختلطة إلى  الصف السادس	نعم ، صعوبات تعلم ، اعاقة حركية ، توحد، حالات متنوعة حسب الحالة	وطني	الإنجليزية / عربية	450	500	550	700	720	740	760	780	800	\N	\N	\N	\N	\N	\N
خريبة السوق وجاوا واليادودة	الدرة الشریفة - اليادودة	الصف الثاني عشر	مختلطة إلى  الصف الثالث	لا	وطني	العربية	617	650	683	750	800	850	900	950	1000	1050	1100	1150	1200	1250	\N
خريبة السوق وجاوا واليادودة	طريق العباقرة	الصف السادس	مختلطة إلى  الصف السادس	لا	وطني/اجنبي	الإنجليزية / عربية	\N	900	1000	1000	1025	1050	1075	\N	\N	\N	\N	\N	\N	\N	\N
المقابلين والبنيات	مدارس دروب الاصالة والمعاصرة	الصف الثاني عشر	مختلطة إلى  الصف الثالث	لا	وطني	العربية	957	1030	1103	1250	1315	1380	1445	1527	1608	1690	1744	1798	1852	1906	1960
المقابلين والبنيات	الفكر التربوي (3) - البنيات	الصف الثاني عشر	مختلطة إلى  الصف الرابع	نعم ، التوحد;إعاقة حركية;صعوبات تعلم	وطني	العربية	\N	650	700	1000	1000	1000	1300	1300	1300	1500	1600	1700	1800	2000	2300
\N	\N	\N	\N	\N	وطني	العربية	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N
\N	\N	\N	\N	\N	وطني	العربية	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N
\N	\N	\N	\N	\N	وطني	العربية	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N
\N	\N	\N	\N	\N	وطني	العربية	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N	\N
\.


--
-- Data for Name: user_filters; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.user_filters (id, firebase_uid, location, special_needs, language, mixed, grade_from, grade_to, created_at) FROM stdin;
1	Kb6o71a2nJXDEqjdYKqGKWHAKcA3	الخشافية	لا	العربية	لا			2025-05-09 18:03:02.301276
2	pe4BPLLbpXf2GxRZ0gXZW1uSZAc2							2025-05-09 18:29:44.101892
3	O2tcHE51ELbncG9uU5uwtzyKUpD3	البيادر	لا	العربية	لا	4	7	2025-05-09 19:20:05.46675
4	pe4BPLLbpXf2GxRZ0gXZW1uSZAc2	البيادر	لا	العربية	لا	6	8	2025-05-11 14:41:57.437311
5	pe4BPLLbpXf2GxRZ0gXZW1uSZAc2		لا		لا	6	8	2025-05-11 14:42:03.156725
6	pe4BPLLbpXf2GxRZ0gXZW1uSZAc2		نعم		نعم	6	8	2025-05-11 14:42:16.489032
7	pe4BPLLbpXf2GxRZ0gXZW1uSZAc2		نعم		نعم	6	6	2025-05-11 14:42:56.821099
8	pe4BPLLbpXf2GxRZ0gXZW1uSZAc2	الظهير	لا	العربية	لا	7	10	2025-05-12 12:13:06.355266
9	pe4BPLLbpXf2GxRZ0gXZW1uSZAc2	البيادر	لا	العربية	لا	7	10	2025-05-12 12:13:14.81447
10	pe4BPLLbpXf2GxRZ0gXZW1uSZAc2		لا		لا	7	10	2025-05-12 12:13:18.869112
11	gjGq7vQB1JeB4omRurQXtzvtLmp2	البيادر	لا	العربية				2025-05-12 12:33:18.052708
12	pe4BPLLbpXf2GxRZ0gXZW1uSZAc2	البيادر	لا					2025-05-12 12:37:17.121234
13	pe4BPLLbpXf2GxRZ0gXZW1uSZAc2		لا					2025-05-12 12:37:27.174581
14	pe4BPLLbpXf2GxRZ0gXZW1uSZAc2	البيادر	لا	الإنجليزية / عربية	لا			2025-05-12 12:38:42.24248
\.


--
-- Name: user_filters_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.user_filters_id_seq', 14, true);


--
-- Name: user_filters user_filters_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_filters
    ADD CONSTRAINT user_filters_pkey PRIMARY KEY (id);


--
-- Name: SCHEMA public; Type: ACL; Schema: -; Owner: pg_database_owner
--

--GRANT USAGE ON SCHEMA public TO username;


--
-- Name: TABLE schooldata; Type: ACL; Schema: public; Owner: postgres
--

--GRANT SELECT ON TABLE public.schooldata TO username;


--
-- PostgreSQL database dump complete
--

